; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types aircraft person - locatable
	locatable city flevel - object)

(:predicates (at ?x - locatable ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?o1 - person ?o2 - aircraft ?o3 - city)
 :precondition (and (at ?o1 ?o3)
                    (at ?o2 ?o3))
 :effect (and (not (at ?o1 ?o3))
              (in ?o1 ?o2)))

(:action debark
 :parameters (?o1 - person ?o2 - aircraft ?o3 - city)
 :precondition (and (in ?o1 ?o2)
                    (at ?o2 ?o3))
 :effect (and (not (in ?o1 ?o2))
              (at ?o1 ?o3)))


(:action fly 
 :parameters (?o1 - aircraft ?o2 - city ?o3 - city ?o4 - flevel ?o5 - flevel)
 :precondition (and (at ?o1 ?o2)
                 (fuel-level ?o1 ?o4)
		 (next ?o5 ?o4))
 :effect (and (not (at ?o1 ?o2))
              (at ?o1 ?o3)
              (not (fuel-level ?o1 ?o4))
              (fuel-level ?o1 ?o5)))
                                  
(:action zoom
 :parameters (?o1 - aircraft ?o2 - city ?o3 - city ?o4 - flevel ?o5 - flevel ?o6 - flevel)
 :precondition (and (at ?o1 ?o2)
                    (fuel-level ?o1 ?o4)
		    (next ?o5 ?o4)
		    (next ?o6 ?o5))
 :effect (and (not (at ?o1 ?o2))
              (at ?o1 ?o3)
              (not (fuel-level ?o1 ?o4))
              (fuel-level ?o1 ?o6)))


(:action refuel
 :parameters (?o1 - aircraft ?o2 - city ?o3 - flevel ?o4 - flevel)
 :precondition (and (fuel-level ?o1 ?o3)
                    (next ?o3 ?o4)
                    (at ?o1 ?o2))
 :effect (and (fuel-level ?o1 ?o4)
 	      (not (fuel-level ?o1 ?o3))))
)

; problem
(define (problem ztravel-2-5)
  (:domain zeno-travel)
  (:objects plane1 -  aircraft plane2 -  aircraft person1 -  person person2 -  person person4 -  person person3 -  person person5 -  person city0 -  city city1 -  city city2 -  city fl0 -  flevel fl1 -  flevel fl2 -  flevel fl3 -  flevel fl4 -  flevel )
  (:init (next fl3 fl4) (at person5 city2) (at person2 city0) (next fl0 fl1) (next fl1 fl2) (next fl2 fl3) (at plane2 city2) (at person4 city1) (fuel-level plane2 fl2) (at plane1 city0) (fuel-level plane1 fl2) (in person1 plane1) (at person3 city2) )
  (:goal (and (next fl3 fl4)(at person2 city0)(next fl0 fl1)(next fl1 fl2)(next fl2 fl3)(at plane2 city2)(at person4 city1)(fuel-level plane2 fl3)(at plane1 city1)(fuel-level plane1 fl1)(in person3 plane2)(in person5 plane2)(at person1 city1)(not (in person1 plane1))(not (in person1 plane2))(not (in person2 plane1))(not (in person2 plane2))(not (in person3 plane1))(not (in person4 plane1))(not (in person4 plane2))(not (in person5 plane1))(not (fuel-level plane1 fl0))(not (fuel-level plane1 fl2))(not (fuel-level plane1 fl3))(not (fuel-level plane1 fl4))(not (fuel-level plane2 fl0))(not (fuel-level plane2 fl1))(not (fuel-level plane2 fl2))(not (fuel-level plane2 fl4))(not (next fl0 fl0))(not (next fl0 fl2))(not (next fl0 fl3))(not (next fl0 fl4))(not (next fl1 fl0))(not (next fl1 fl1))(not (next fl1 fl3))(not (next fl1 fl4))(not (next fl2 fl0))(not (next fl2 fl1))(not (next fl2 fl2))(not (next fl2 fl4))(not (next fl3 fl0))(not (next fl3 fl1))(not (next fl3 fl2))(not (next fl3 fl3))(not (next fl4 fl0))(not (next fl4 fl1))(not (next fl4 fl2))(not (next fl4 fl3))(not (next fl4 fl4)))))

; plan
1. (refuel plane2 city2 fl2 fl3)
   deleted: (fuel-level plane2 fl2)
   added: (fuel-level plane2 fl3)
   goals met: 43 of 50
2. (fly plane1 city0 city1 fl2 fl1)
   deleted: (at plane1 city0) (fuel-level plane1 fl2)
   added: (at plane1 city1) (fuel-level plane1 fl1)
   goals met: 46 of 50
3. (board person3 plane2 city2)
   deleted: (at person3 city2)
   added: (in person3 plane2)
   goals met: 47 of 50
4. (board person5 plane2 city2)
   deleted: (at person5 city2)
   added: (in person5 plane2)
   goals met: 48 of 50
5. (debark person1 plane1 city1)
   deleted: (in person1 plane1)
   added: (at person1 city1)
   goals met: 50 of 50
